#+title: notes/lisp
<2022-03-19 Sat>
*** Local Named Functions
- To define a local function use the =flet= form
- =flet= is very similar to =let= for variables but instead
#+begin_src lisp
  (flet ((function_name (arguments)
	   ...function body))
    ...body)
#+end_src
- If you want to reference other local functions in an =flet= you should use =labels= instead
- You can also =labels= to call a local named function recursively
#+begin_src lisp
  (labels ((function_a (n)
	     (+ n 2))
	   (function_b (n)
	     (function_a (function_a n))))
    (function_b 2))
#+end_src

#+RESULTS:
: 6
*** Converting to and from character lists
- Use =coerce= with either the =list= or =string= type
- =(coerce "ABC" 'list)= should return =(#\A #\B #\C)=
- =(coerce '(#\A #\B #\C) 'string)= should return ="ABC"=
- This can be used with =mapcar= to iterate over each character
#+begin_src lisp
(mapcar #'(lambda (c)
	    (princ (format nil "char: ~C~C" c #\newline)))
	(coerce "abc123" 'list))
#+end_src

#+RESULTS:
| char: a |
| char: b |
| char: c |
| char: 1 |
| char: 2 |
| char: 3 |

*** push
- Adds item to the beginning of a list
- The list must be a variable
#+begin_src lisp
  (defparameter *some-list* nil)

  (push 4 *some-list*)
  (push 3 *some-list*)
  (push 2 *some-list*)
  (push 1 *some-list*)
  ,*some-list*
#+end_src

#+RESULTS:
| 1 | 2 | 3 | 4 |
** Association Lists (alists)
- Use =assoc= to find the value of a key in an alist
#+begin_src lisp
  (assoc 'mykey '((somekey (some-value))
		  (mykey (my-value))
		  (otherkey (other-value))))
#+end_src
#+RESULTS:
| MYKEY | (MY-VALUE) |
- alists can have multiple instances of a key inside them
- When this happens =assoc= will return the first instance
- If you push new keys into the alist you can overwrite the value of a key while preserving the previous value
- You can use =setf= to change the value of an list, =(setf (cadr (assoc '2 alist)) t)=
- alists are not very efficient beyond a dozen items
*** Files
- =with-open-file= optionally accepts a steam and file name to open a file
- If you do not pass in an existing stream a new one is created
- With the stream variable print functions can send their output to that file
- If the stream is =*standard-output*= then the print functions will automatically send the output to the file
#+begin_src lisp
  (with-open-file (stream
		   "~/tmp/testfile.txt"
		   :direction :output
		   :if-exists :supersede)
    (princ "Hello World!" stream)
    (princ #\newline stream))
#+end_src

#+RESULTS:
: #\Newline
- There is a global stream =*standard-ouput*= that represents stdout of the lisp environment
